#+Title: Experience Report:\newline Steps to "Emacs Hyper Notebooks"
#+Author: Joseph Corneli, Raymond Puzio, and Cameron Ray Smith
#+Date: 10 minute talk for EmacsConf 2020 (draft: \today)
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage[utf8x]{inputenc}


* Naive calculation, using Maxima mode

Notice that this computation requires a *partridge in a pear tree*-like
setup. I.e., we keep recomputing at each step: =<<solve-for-u>>=.
#+NAME: solve-for-u0
#+HEADER: :exports none
#+BEGIN_SRC maxima :results raw
tex(u0sol : part(solve ([u/(D*u + s) = %e^(-s*v) * u0/(D*u0 + s)], [u0]), 1 , 2));
#+END_SRC
#+RESULTS: solve-for-u0
$$-{{s\,u\,e^{s\,v}}\over{D\,u\,e^{s\,v}-D\,u-s}}$$
#+NAME: check-characteristic-u
#+HEADER: :exports none
#+BEGIN_SRC maxima :results raw :noweb yes
<<solve-for-u>>
tex(factor(diff(usol, v) + usol*(D*usol + s)));
#+END_SRC
#+RESULTS: check-characteristic-u
$${{s\,u_{0}}\over{\left(D\,u_{0}+s\right)\,e^{s\,v}-D\,u_{0}}}$$
$$0$$
